Lb=[2000:66000];
n1=ceil((1-0.000005).^(-8*(Lb+8+(Lb+20)/(1500-20)*28)));
h1 =plot(Lb,n1,'-b');
hold on; 
n2=ceil((1-0.000005).^(-8*(Lb+8+(Lb+20)/(1500-20)*28)))+3;
h2 =plot(Lb,n2,'-k');
hold on;





%第一组实验数据
C1_16K =[2,2,2,2,2,2,2,3,2,2]; % case1,16k
C1_32K =[4,4,4,3,3,3,5,5,5,4];
C1_48K =[8,7,8,9,8,10,6,8,8,9];
C1_64K =[14,12,15,14,13,15,14,14,14,14]; 
   
I11 =zeros(4,10);
 
I11(1,:)= C1_16K;
I11(2,:)= C1_32K;
I11(3,:)= C1_48K;
I11(4,:)= C1_64K;
% 
% 
J11=I11';
M11=mean(J11);
S11=std(J11);
S11=S11/10; 
bar11=2.131.*S11;
x1=[16000 32000 48000 64000];

h11=errorbar(x1,M11,bar11,'or');
hold on;
%第二组数据
C1_16K =[6,7,7,3,5,4,5,6,4,5 ]; % case1,16k
C1_32K =[9,9,10,7,7,7,7,5,5,8];
C1_48K =[11,8,11,11,11,11,12,13,13,12];
C1_64K =[21,17,19,15,14,17,15,14,19,22]; 
% 
% 
I11(1,:)= C1_16K;
I11(2,:)= C1_32K;
I11(3,:)= C1_48K;
I11(4,:)= C1_64K;
% 
% 
J11=I11';
M11=mean(J11);
S11=std(J11);
S11=S11/10; 
bar11=2.131.*S11;
x1=[16000 32000 48000 64000];

h22=errorbar(x1,M11,bar11,'dr');
hold on;



set(gca, 'XLim', [2000, 66000]);
set(gca,'Xtick', [4000 8000 12000 16000 20000 24000 28000 32000 36000 40000 44000 48000 52000 56000 60000 64000] ); 
set(gca,'XTickLabel',{'4' '8' '12' '16' '20' '24' '28' '32' '36' '40' '44' '48' '52' '56' '60' '64'});


xlabel('Bundle尺寸 (Kbytes)','fontweight','normal','fontsize',13);
ylabel('传输次数（次数）','fontweight','normal','fontsize',13);
 set(gca,'fontweight','bold','fontsize',13);
set(gca,'YLim',[0 20],'YTick',[0 2 4 6 8 10 12 14 16 18 20],...
  'YTickLabel',{'0' '2' '4' '6' '8' '10' '12' '14' '16' '18' '20'});
set([h1],'LineWidth',2.3,'MarkerSize',6.0);
set([h2],'LineWidth',2.3,'MarkerSize',6.0);
% 
set([h11],'LineWidth',2.3,'MarkerSize',6.0);
set([h22],'LineWidth',2.3,'MarkerSize',6.0);

legend([h1 h11 h2 h22 ],'无中断理论值','无中断实验值','中断理论值','中断实验值');

grid on;
