Lb=[2000:66000];
n1=ceil((1-0.000005).^(-8*(Lb+8+(Lb+20)/(1500-20)*28)));
n2=ceil((1-0.000003).^(-8*(Lb+8+(Lb+20)/(1500-20)*28)));
nwu=n1+n2;
h1 =plot(Lb,nwu,'-b');
hold on; 
n3=ceil((1-0.000005).^(-8*(Lb+8+(Lb+20)/(1500-20)*28)));
n4=ceil((1-0.000003).^(-8*(Lb+8+(Lb+20)/(1500-20)*28)))+1;
nyou=n3+n4;
h2 =plot(Lb,nyou,'-k');
hold on;


%第一组实验数据
C1_16K =[4,4,4,4,4,4,4,5,4,4]; % case1,16k
C1_32K =[7,7,7,6,6,6,8,8,8,7];
C1_48K =[12,11,12,13,12,14,10,12,12,13];
C1_64K =[19,19,22,18,18,20,19,19,19,19]; 
   
I11 =zeros(4,10);
 
I11(1,:)= C1_16K;
I11(2,:)= C1_32K;
I11(3,:)= C1_48K;
I11(4,:)= C1_64K;
% 
% 
J11=I11';
M11=mean(J11);
S11=std(J11);
S11=S11/10; 
bar11=2.131.*S11;
x1=[16000 32000 48000 64000];
h11=errorbar(x1,M11,bar11,'or');
hold on;
%第二组数据
C2_16K =[5,6,6,4,6,5,6,5,5,6 ]; % case1,16k
C2_32K =[8,8,9,7,9,7,9,6,6,8];
C2_48K =[13,10,13,13,13,13,14,15,15,14];
C2_64K =[20,16,18,14,13,16,14,13,18,21]; 
% 
% 
I22(1,:)= C2_16K;
I22(2,:)= C2_32K;
I22(3,:)= C2_48K;
I22(4,:)= C2_64K;
% 
% 
J22=I22';
M22=mean(J22);
S22=std(J22);
S22=S22/10; 
bar22=2.131.*S22;
x2=[16000 32000 48000 64000];
h22=errorbar(x2,M22,bar11,'dr');
hold on;



set(gca, 'XLim', [2000, 66000]);
set(gca,'Xtick', [4000 8000 12000 16000 20000 24000 28000 32000 36000 40000 44000 48000 52000 56000 60000 64000] ); 
set(gca,'XTickLabel',{'4' '8' '12' '16' '20' '24' '28' '32' '36' '40' '44' '48' '52' '56' '60' '64'});


xlabel('Bundle尺寸 (Kbytes)','fontweight','normal','fontsize',13);
ylabel('传输次数（次数）','fontweight','normal','fontsize',13);
 set(gca,'fontweight','bold','fontsize',13);
set(gca,'YLim',[0 20],'YTick',[0 2 4 6 8 10 12 14 16 18 20],...
  'YTickLabel',{'0' '2' '4' '6' '8' '10' '12' '14' '16' '18' '20'});
set([h1],'LineWidth',2.3,'MarkerSize',6.0);
set([h2],'LineWidth',2.3,'MarkerSize',6.0);
% 
set([h11],'LineWidth',2.3,'MarkerSize',6.0);
set([h22],'LineWidth',2.3,'MarkerSize',6.0);

legend([h1 h11 h2 h22 ],'无中断理论值','无中断实验值','中断理论值','中断实验值');

grid on;
